{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/AnomolousSignInsBasedonTime')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Anomolous Sign Ins Based on Time",
        "category": "Hunting Queries",
        "query": "let admins = (IdentityInfo\n| where AssignedRoles contains \"Admin\"\n| summarize by tolower(AccountUPN));\nlet ts_data = (SigninLogs\n| where TimeGenerated > ago(14d)\n| extend AccountUPN = tolower(UserPrincipalName)\n| where AccountUPN in (admins)\n| make-series count() on TimeGenerated step 1h by UserPrincipalName\n| extend series_decompose(count_)\n| extend NoLogons = count_);\nlet TimeSeriesAlerts=ts_data\n| extend (anomalies, score, baseline) = series_decompose_anomalies(count_, 2.5, -1, 'linefit',0, 'ctukey', 3)\n| mv-expand NoLogons to typeof(double), TimeGenerated to typeof(datetime), anomalies to typeof(double),score to typeof(double), baseline to typeof(long)\n| where anomalies > 0\n| where NoLogons > 15\n| project UserPrincipalName, TimeGenerated, NoLogons, baseline, anomalies, score;\nTimeSeriesAlerts\n| join kind=inner (\nSigninLogs\n| summarize ResultTypeCount=count(),ResultTypes=make_set(ResultType), Locations=make_set(Location), Apps=make_set(AppDisplayName), Ips=make_set( IPAddress) by UserPrincipalName, bin(TimeGenerated, 1h)\n) on UserPrincipalName, TimeGenerated\n| summarize AnomolyTimes = make_set(TimeGenerated), Ips = make_set(Ips), Apps = make_set(Apps), sum(anomalies), Locations=make_set(Locations) by UserPrincipalName\n| sort by sum_anomalies desc\n",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Identifies anomolies in signin events based on the volume of signin events over time. Use this to identify suspicious authentication patterns such as spikes in activity or out of hours events.\nRef : https://docs.microsoft.comazure/active-di"
          },
          {
            "name": "tactics",
            "value": "InitialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1078.004"
          }
        ]
      }
    }
  ]
}
