{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/AWS_Unused_UnsupportedCloudRegions')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Unused or Unsupported Cloud Regions",
        "category": "Hunting Queries",
        "query": "\nlet starttime = todatetime('{{StartTimeISO}}');\nlet endtime = todatetime('{{EndTimeISO}}');\nlet lookback = starttime - 14d;\nlet midtime = starttime - 1d;\n// Generating historical table of all events per AccountId and Region\nlet EventInfo_CurrentDay =  materialize (AWSCloudTrail | where TimeGenerated between(starttime..endtime));\nlet EventInfo_historical = AWSCloudTrail  | where TimeGenerated  between (lookback..midtime) | summarize max(TimeGenerated) by AWSRegion, UserIdentityAccountId;\n// Doing Leftanti join to find new regions historically not seen for the same account.\nlet EventInfo_Unseen = materialize (\nEventInfo_CurrentDay\n| summarize max(TimeGenerated) by AWSRegion, UserIdentityAccountId\n| join kind= leftanti\n(\n  EventInfo_historical\n) on AWSRegion, UserIdentityAccountId\n);\nEventInfo_Unseen\n// Join Ununsed region seen with current data to gather context about API events seen\n| join kind= inner (\n   EventInfo_CurrentDay\n) on AWSRegion, UserIdentityAccountId\n| extend UnusedRegion = AWSRegion\n| extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))\n| summarize EventCount = count(), StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), EventNameList=make_set(EventName), IPList=make_set(SourceIpAddress) by UserIdentityAccountId, UnusedRegion, UserIdentityUserName\n| extend timestamp = StartTime , AccountCustomEntity = UserIdentityUserName\n",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Adversaries may create cloud instances in unused geographic service regions in order to evade detection.\nAccess is usually obtained through compromising accounts used to manage cloud infrastructure.\nRefer: https://attack.mitre.org/technique"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1535"
          }
        ]
      }
    }
  ]
}
