{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/AWS_SuspiciousCredentialTokenAccessOfValid_IAM_Roles')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious credential token access of valid IAM Roles",
        "category": "Hunting Queries",
        "query": "\nlet starttime = todatetime('{{StartTimeISO}}');\nlet endtime = todatetime('{{EndTimeISO}}');\nlet lookback = starttime - 14d;\nlet midtime = starttime - 1d;\n// Generating historical table of AssumeRole operations for IAM Roles to be compared with last 24 hour\nAWSCloudTrail\n| where TimeGenerated between (starttime..endtime)\n| where EventName == \"AssumeRole\" | extend RoleArn = tostring(parse_json(RequestParameters).roleArn)\n| project TimeGenerated, EventSource, EventName, UserIdentityType, UserIdentityInvokedBy , SourceIpAddress, RoleArn\n// Doing Leftanti join to find new AssumeRole operation for IAM role which was not seen historically generated from previous table.\n| join kind= leftanti\n(\n  AWSCloudTrail\n  | where TimeGenerated  between (lookback..midtime)\n  | where EventName == \"AssumeRole\" | extend RoleArn = tostring(parse_json(RequestParameters).roleArn)\n  | project TimeGenerated, EventSource, EventName, UserIdentityType, UserIdentityInvokedBy , SourceIpAddress, RoleArn\n) on RoleArn, UserIdentityInvokedBy\n| summarize EventCount = count(), StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by RoleArn, EventSource, EventName, UserIdentityType, UserIdentityInvokedBy, SourceIpAddress\n| extend timestamp = StartTimeUtc, IPCustomEntity = SourceIpAddress, AccountCustomEntity = tostring(split(RoleArn, \"/\")[1])\n",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Adversaries may generate temporary credentials of existing privileged IAM roles to access AWS resources that were not previously accessible to perform malicious actions. The credentials may be generated by trusted IAM user or via AWS Cloud "
          },
          {
            "name": "tactics",
            "value": "InitialAccess,DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1078"
          }
        ]
      }
    }
  ]
}
