{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/powershell_newencodedscipts')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New PowerShell scripts encoded on the commandline",
        "category": "Hunting Queries",
        "query": "\nlet starttime = todatetime('{{StartTimeISO}}');\nlet endtime = todatetime('{{EndTimeISO}}');\nlet lookback = totimespan((endtime-starttime)*3);\nlet midlookback = totimespan((endtime-starttime)*2);\nlet ProcessCreationEvents=() {\nlet processEvents=SecurityEvent\n| where TimeGenerated between(ago(lookback)..endtime)\n| where EventID==4688\n| project  TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName,AccountDomain=SubjectDomainName,\n  FileName=tostring(split(NewProcessName, '\\\\')[-1]),\nProcessCommandLine = CommandLine,\nInitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine=\"\",InitiatingProcessParentFileName=\"\";\nprocessEvents};\nlet encodedPSScripts =\nProcessCreationEvents\n| where TimeGenerated between(ago(midlookback)..starttime)\n| where FileName =~ \"powershell.exe\"\n| where ProcessCommandLine contains \"-encodedCommand\";\nencodedPSScripts\n| where TimeGenerated between(starttime..endtime)\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by ProcessCommandLine\n| parse ProcessCommandLine with * \"-EncodedCommand \" encodedCommand\n| project StartTimeUtc, EndTimeUtc, decodedCommand=base64_decodestring(substring(encodedCommand, 0,\n strlen(encodedCommand) - (strlen(encodedCommand) %8))), encodedCommand\n| join kind=anti (encodedPSScripts\n  | where TimeGenerated between(ago(lookback)..starttime)\n  | summarize count() by ProcessCommandLine\n  | parse ProcessCommandLine with * \"-EncodedCommand \" encodedCommand\n  | project decodedCommand=base64_decodestring(substring(encodedCommand, 0,\n   strlen(encodedCommand) - (strlen(encodedCommand) %8))), encodedCommand\n) on encodedCommand, decodedCommand\n| extend timestamp = StartTimeUtc\n",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Identify and decode new encoded powershell scripts this week versus previous 14 days"
          },
          {
            "name": "tactics",
            "value": "Execution,CommandAndControl"
          }
        ]
      }
    }
  ]
}
