{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PrivilegedAccountPasswordChanges')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Privileged Account Password Changes",
        "category": "Hunting Queries",
        "query": "let priority_threshold = 5;\nlet admins = (IdentityInfo\n| where AssignedRoles contains \"Admin\"\n| summarize by tolower(AccountUPN));\nAuditLogs\n| where Category =~ \"UserManagement\"\n| where OperationName has_any (\"password\", \"security info\")\n| extend AccountUPN = tolower(tostring(TargetResources[0].userPrincipalName))\n| where AccountUPN in (admins)\n| join kind=inner (BehaviorAnalytics | where InvestigationPriority > priority_threshold | where isnotempty(UserPrincipalName)| summarize by UserPrincipalName | extend AccountUPN = tolower(UserPrincipalName)) on AccountUPN\n| extend AccountCustomEntity = AccountUPN\n",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Identifies where Privileged Accounts have updated passwords or security information. This is joined with UEBA alerts to filter to only those accounts with a high investigation priority.\nRef : https://docs.microsoft.comazure/active-directory"
          },
          {
            "name": "tactics",
            "value": "InitialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1078.004"
          }
        ]
      }
    }
  ]
}
