{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Sample-DNSEventsMatchToThreatIntel')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Preview - DNS Events that match threat intelligence",
        "category": "Hunting Queries",
        "query": "\nDnsEvents\n| join (ThreatIntelligenceIndicator\n  | summarize arg_max(TimeGenerated, *) by IndicatorId\n  | summarize by Url) on $left.Name == $right.Url\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count()\nby Computer, ClientIP, ThreatIntel_Related_Domain = Name, Url\n| extend timestamp = StartTimeUtc, HostCustomEntity = Computer, IPCustomEntity = ClientIP, URLCustomEntity = Url\n",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "This sample hunting query demonstrates how to utilize the threat intelligence data with the DNS event logs"
          },
          {
            "name": "tactics",
            "value": "Impact"
          }
        ]
      }
    }
  ]
}
